InformationRegisters/Выезд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Выезд</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/БалансДолжников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>БалансДолжников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныйОсновнойДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПросроченныеПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Неустойка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Госпошлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/РежимыРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РежимыРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обзвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаДопИнформации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ДанныеПоВыездам/Ext/Module.bsl
Функция ПолучитьСводнуюТаблицуДляВыезда(Дата, Сотрудник, СписокДолжников) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Новых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Выезд,
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление КАК Направление,
	               |	ВыездСрезПоследних.Должник.Район КАК Район
	               |ИЗ
	               |	РегистрСведений.Выезд.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = &Сотрудник
	               |				И Должник В (&СписокДолжников)) КАК ВыездСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление,
	               |	ВыездСрезПоследних.Должник.Район";
	
	Запрос.УстановитьПараметр("Дата", 	Дата);
	Запрос.УстановитьПараметр("Обзвон", Перечисления.РежимыРаботы.Обзвон);
	Запрос.УстановитьПараметр("Выезд", 	Перечисления.РежимыРаботы.Выезд);
	Запрос.УстановитьПараметр("СписокДолжников", СписокДолжников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции // ПолучитьСводнуюТаблицуДляВыезда()
 
Функция ПолучитьСводнуюТаблицуДляВыездаССуммами(Дата, Сотрудник, СписокДолжников) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Новых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Выезд,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаОбзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаНовых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаВыезд,
	               |	СУММА(1) КАК ВсегоДолжников,
	               |	СУММА(БалансДолжниковОстатки.СуммаОстаток) КАК СуммаВсего,
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление КАК Направление,
	               |	ВыездСрезПоследних.Должник.Район КАК Район
	               |ИЗ
	               |	РегистрСведений.Выезд.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = &Сотрудник
	               |				И Должник В (&СписокДолжников)) КАК ВыездСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БалансДолжников.Остатки(&Дата, Должник В (&СписокДолжников)) КАК БалансДолжниковОстатки
	               |		ПО ВыездСрезПоследних.Должник = БалансДолжниковОстатки.Должник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление,
	               |	ВыездСрезПоследних.Должник.Район";
	
	Запрос.УстановитьПараметр("Дата", 				Дата);
	Запрос.УстановитьПараметр("Обзвон", 			Перечисления.РежимыРаботы.Обзвон);
	Запрос.УстановитьПараметр("Выезд", 				Перечисления.РежимыРаботы.Выезд);
	Запрос.УстановитьПараметр("Сотрудник", 			Сотрудник);
	Запрос.УстановитьПараметр("СписокДолжников", 	СписокДолжников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции // ПолучитьСводнуюТаблицуДляВыезда()

Функция ПолучитьСводнуюТаблицуДляВыездаССуммами_БезДат(Дата, Сотрудник, СписокДолжников) Экспорт
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Новых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Выезд,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Обзвон
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаОбзвон,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.Новый = ИСТИНА
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаНовых,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВыездСрезПоследних.РежимРаботы = &Выезд
	               |				ТОГДА БалансДолжниковОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаВыезд,
	               |	СУММА(1) КАК ВсегоДолжников,
	               |	СУММА(БалансДолжниковОстатки.СуммаОстаток) КАК СуммаВсего,
	               |	ВыездСрезПоследних.Дата,
	               |	ВыездСрезПоследних.Должник.Направление КАК Направление,
	               |	ВыездСрезПоследних.Должник.Район КАК Район
	               |ИЗ
	               |	РегистрСведений.Выезд.СрезПоследних(
	               |			&Дата,
	               |			Сотрудник = &Сотрудник
	               |				И Должник В (&СписокДолжников)) КАК ВыездСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БалансДолжников.Остатки(&Дата, Должник В (&СписокДолжников)) КАК БалансДолжниковОстатки
	               |		ПО ВыездСрезПоследних.Должник = БалансДолжниковОстатки.Должник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВыездСрезПоследних.Должник.Направление,
	               |	ВыездСрезПоследних.Должник.Район";
	
	Запрос.УстановитьПараметр("Дата", 				Дата);
	Запрос.УстановитьПараметр("Обзвон", 			Перечисления.РежимыРаботы.Обзвон);
	Запрос.УстановитьПараметр("Выезд", 				Перечисления.РежимыРаботы.Выезд);
	Запрос.УстановитьПараметр("Сотрудник", 			Сотрудник);
	Запрос.УстановитьПараметр("СписокДолжников", 	СписокДолжников);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции // ПолучитьСводнуюТаблицуДляВыезда()
